In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns
#import plotly.express as px
#import plotly.graph_objects as go

folder_name = './Looker Ecommerce BigQuery Dataset/'

In [2]:
orders = pd.read_csv(folder_name + 'orders.csv')
order_items = pd.read_csv(folder_name + 'order_items.csv')
products = pd.read_csv(folder_name + 'products.csv')
users = pd.read_csv(folder_name + 'users.csv')

In [16]:
dist_center = pd.read_csv(folder_name + 'distribution_centers.csv')
#inv_items = pd.read_csv(folder_name + 'inventory_items.csv')
#events = pd.read_csv(folder_name + 'events.csv')

## 데이터 파악

In [3]:
orders = orders.assign(created_at=pd.to_datetime(orders['created_at'], format='ISO8601'))

In [4]:
orders

,order_id,user_id,status,gender,created_at,returned_at,shipped_at,delivered_at,num_of_item
0,8,5,Cancelled,F,2022-10-20 10:03:00+00:00,NaN,NaN,NaN,3
1,60,44,Cancelled,F,2023-01-20 02:12:00+00:00,NaN,NaN,NaN,1
2,64,46,Cancelled,F,2021-12-06 09:11:00+00:00,NaN,NaN,NaN,1
3,89,65,Cancelled,F,2020-08-13 09:58:00+00:00,NaN,NaN,NaN,1
4,102,76,Cancelled,F,2023-01-17 08:17:00+00:00,NaN,NaN,NaN,2
...,...,...,...,...,...,...,...,...,...
125221,125196,99972,Shipped,M,2022-06-25 11:56:00+00:00,NaN,2022-06-28 08:24:00+00:00,NaN,1
125222,125199,99975,Shipped,M,2022-07-20 02:19:00+00:00,NaN,2022-07-22 11:08:00+00:00,NaN,4
125223,125208,99983,Shipped,M,2022-03-14 15:06:00+00:00,NaN,2022-03-17 05:15:00+00:00,NaN,1
125224,125210,99983,Shipped,M,2023-03-01 15:06:00+00:00,NaN,2023-03-02 10:50:00+00:00,NaN,2
125225,125224,99999,Shipped,M,2023-12-22 11:29:00+00:00,NaN,2023-12-24 00:44:00+00:00,NaN,2

In [5]:
orders['created_at'].describe()
# 19년도 1월 6일 ~ 24년도 1월 17일

count                                 125226
mean     2022-10-25 00:25:31.427571712+00:00
min                2019-01-06 05:30:00+00:00
25%                2022-02-26 07:50:00+00:00
50%                2023-02-20 08:08:00+00:00
75%                2023-09-26 09:51:30+00:00
max         2024-01-17 19:46:14.316147+00:00
Name: created_at, dtype: object

In [6]:
orders['order_id'].nunique()

125226

In [7]:
ret = orders['user_id'].value_counts().to_frame()

In [8]:
ret['count'].value_counts()
# 재구매는 최대 4번까지 존재
# 첫구매는 49,832명
# 재구매는 30,212명

count
1    49832
2    20231
3     4992
4     4989
Name: count, dtype: int64

In [9]:
orders['user_id'].nunique()
# 주문한 유저 8만명

80044

In [10]:
# 전체 유저 10만명
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 15 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id              100000 non-null  int64
 1   first_name      100000 non-null  object
 2   last_name       100000 non-null  object
 3   email           100000 non-null  object
 4   age             100000 non-null  int64
 5   gender          100000 non-null  object
 6   state           100000 non-null  object
 7   street_address  100000 non-null  object
 8   postal_code     100000 non-null  object
 9   city            99042 non-null   object
 10  country         100000 non-null  object
 11  latitude        100000 non-null  float64
 12  longitude       100000 non-null  float64
 13  traffic_source  100000 non-null  object
 14  created_at      100000 non-null  object
dtypes: float64(2), int64(2), object(11)
memory usage: 11.4+ MB

In [11]:
users['id'].nunique()
# 동명이인 존재
#df = df.assign(name=df['first_name'] + ' ' + df['last_name'])

100000

In [12]:
products['id'].nunique()
# 제품 수 29,120개

29120

In [13]:
products['cost'].describe()

count    29120.000000
mean        28.481774
std         30.624681
min          0.008300
25%         11.275613
50%         19.675081
75%         34.440000
max        557.151002
Name: cost, dtype: float64

In [22]:
# 카테고리 26개
products['category'].nunique()

26

In [14]:
products['category'].value_counts()

category
Intimates                        2363
Jeans                            1999
Tops & Tees                      1868
Fashion Hoodies & Sweatshirts    1866
Swim                             1798
Sleep & Lounge                   1771
Shorts                           1765
Sweaters                         1737
Accessories                      1559
Active                           1432
Outerwear & Coats                1420
Underwear                        1088
Pants                            1041
Dresses                           955
Socks                             905
Maternity                         898
Plus                              758
Suits & Sport Coats               739
Socks & Hosiery                   666
Pants & Capris                    613
Leggings                          564
Blazers & Jackets                 561
Skirts                            367
Suits                             188
Jumpsuits & Rompers               162
Clothing Sets                      37
Name: count, dtype: int64

In [17]:
# 온라인 마케팅 구매 전환율 파악 가능할듯
#events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2431963 entries, 0 to 2431962
Data columns (total 13 columns):
 #   Column           Dtype
---  ------           -----
 0   id               int64
 1   user_id          float64
 2   sequence_number  int64
 3   session_id       object
 4   created_at       object
 5   ip_address       object
 6   city             object
 7   state            object
 8   postal_code      object
 9   browser          object
 10  traffic_source   object
 11  uri              object
 12  event_type       object
dtypes: float64(1), int64(2), object(10)
memory usage: 241.2+ MB

In [18]:
#events.describe(include='all')

,id,user_id,sequence_number,session_id,created_at,ip_address,city,state,postal_code,browser,traffic_source,uri,event_type
count,2.431963e+06,1.306292e+06,2.431963e+06,2431963,2431963,2431963,2408883,2431963,2431963,2431963,2431963,2431963,2431963
unique,NaN,NaN,NaN,681759,2143390,681683,8775,231,17324,5,5,35530,6
top,NaN,NaN,NaN,b174d8d5-a07f-44c1-a1c2-226f495b4cf4,2020-10-21 16:07:00+00:00,196.46.153.171,Shanghai,Guangdong,02675-031,Chrome,Email,/cart,product
freq,NaN,NaN,NaN,13,8,17,60561,129796,10147,1218687,1091988,595994,845607
mean,1.215982e+06,4.996636e+04,3.316146e+00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,7.020474e+05,2.881711e+04,2.676365e+00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000e+00,1.000000e+00,1.000000e+00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,6.079915e+05,2.500500e+04,1.000000e+00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,1.215982e+06,4.992700e+04,2.000000e+00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.823972e+06,7.483900e+04,4.000000e+00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,2.431963e+06,1.000000e+05,1.300000e+01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [19]:
#events['traffic_source'].value_counts()

traffic_source
Email       1091988
Adwords      731144
Facebook     243834
YouTube      242938
Organic      122059
Name: count, dtype: int64

In [20]:
# 창고 주소
dist_center

   id                                         name  latitude  longitude
0   1                                   Memphis TN   35.1174   -89.9711
1   2                                   Chicago IL   41.8369   -87.6847
2   3                                   Houston TX   29.7604   -95.3698
3   4                               Los Angeles CA   34.0500  -118.2500
4   5                               New Orleans LA   29.9500   -90.0667
5   6  Port Authority of New York/New Jersey NY/NJ   40.6340   -73.7834
6   7                              Philadelphia PA   39.9500   -75.1667
7   8                                    Mobile AL   30.6944   -88.0431
8   9                                Charleston SC   32.7833   -79.9333
9  10                                  Savannah GA   32.0167   -81.1167

In [21]:
# 창고 재고
#inv_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 490705 entries, 0 to 490704
Data columns (total 12 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   id                              490705 non-null  int64
 1   product_id                      490705 non-null  int64
 2   created_at                      490705 non-null  object
 3   sold_at                         181759 non-null  object
 4   cost                            490705 non-null  float64
 5   product_category                490705 non-null  object
 6   product_name                    490676 non-null  object
 7   product_brand                   490304 non-null  object
 8   product_retail_price            490705 non-null  float64
 9   product_department              490705 non-null  object
 10  product_sku                     490705 non-null  object
 11  product_distribution_center_id  490705 non-null  int64
dtypes: float64(2), int64(3), object(7)
memory usage: 44.9+ MB

## Join: order_items, orders, products, users

In [23]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125226 entries, 0 to 125225
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   order_id      125226 non-null  int64
 1   user_id       125226 non-null  int64
 2   status        125226 non-null  object
 3   gender        125226 non-null  object
 4   created_at    125226 non-null  datetime64[ns, UTC]
 5   returned_at   12530 non-null   object
 6   shipped_at    81461 non-null   object
 7   delivered_at  43884 non-null   object
 8   num_of_item   125226 non-null  int64
dtypes: datetime64[ns, UTC](1), int64(3), object(5)
memory usage: 8.6+ MB

In [24]:
order_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181759 entries, 0 to 181758
Data columns (total 11 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   id                 181759 non-null  int64
 1   order_id           181759 non-null  int64
 2   user_id            181759 non-null  int64
 3   product_id         181759 non-null  int64
 4   inventory_item_id  181759 non-null  int64
 5   status             181759 non-null  object
 6   created_at         181759 non-null  object
 7   shipped_at         118281 non-null  object
 8   delivered_at       63841 non-null   object
 9   returned_at        18232 non-null   object
 10  sale_price         181759 non-null  float64
dtypes: float64(1), int64(5), object(5)
memory usage: 15.3+ MB

In [25]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29120 entries, 0 to 29119
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      29120 non-null  int64
 1   cost                    29120 non-null  float64
 2   category                29120 non-null  object
 3   name                    29118 non-null  object
 4   brand                   29096 non-null  object
 5   retail_price            29120 non-null  float64
 6   department              29120 non-null  object
 7   sku                     29120 non-null  object
 8   distribution_center_id  29120 non-null  int64
dtypes: float64(2), int64(2), object(5)
memory usage: 2.0+ MB

In [26]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 15 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id              100000 non-null  int64
 1   first_name      100000 non-null  object
 2   last_name       100000 non-null  object
 3   email           100000 non-null  object
 4   age             100000 non-null  int64
 5   gender          100000 non-null  object
 6   state           100000 non-null  object
 7   street_address  100000 non-null  object
 8   postal_code     100000 non-null  object
 9   city            99042 non-null   object
 10  country         100000 non-null  object
 11  latitude        100000 non-null  float64
 12  longitude       100000 non-null  float64
 13  traffic_source  100000 non-null  object
 14  created_at      100000 non-null  object
dtypes: float64(2), int64(2), object(11)
memory usage: 11.4+ MB

In [30]:
orders[orders['order_id']==104663]

,order_id,user_id,status,gender,created_at,returned_at,shipped_at,delivered_at,num_of_item
7718,104663,83582,Cancelled,F,2023-05-07 07:33:00+00:00,NaN,NaN,NaN,1

In [33]:
users[users['id']==83582]

,id,first_name,last_name,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
41039,83582,Kathryn,Ortega,kathrynortega@example.net,29,F,Hebei,3863 Johnson Brooks Suite 474,74199,Jinhua,China,39.388173,115.731465,Search,2021-11-27 07:33:00+00:00

In [29]:
order_items[order_items['order_id']==104663]

,id,order_id,user_id,product_id,inventory_item_id,status,created_at,shipped_at,delivered_at,returned_at,sale_price
0,152013,104663,83582,14235,410368,Cancelled,2023-05-07 06:08:40+00:00,NaN,NaN,NaN,0.02

In [31]:
products[products['id']==14235]

,id,cost,category,name,brand,retail_price,department,sku,distribution_center_id
1401,14235,0.0083,Accessories,Indestructable Aluminum Aluma Wallet - RED,marshal,0.02,Women,8425BC94A44E3D1BB3C8C026B2702C00,1

- orders.order_id = order_items.order_id
- orders.user_id = users.id
- order_items.product_id = products.id

=> order_items 기준으로 merge

In [66]:
df = orders.merge(order_items, on=['order_id', 'user_id'], suffixes=('','_order_items'))
df = df.rename(columns={'id':'order_items_id'})

df = df.merge(users, left_on=['user_id', 'gender'], right_on=['id', 'gender'], suffixes=('','_(sign up)'))
df = df.rename(columns={'created_at_(sign up)':'created_account_at'})
df = df.drop(columns='id')

df = df.merge(products, left_on='product_id', right_on='id')
df = df.drop(columns='id')

In [91]:
# 형변환
for col in df.columns:
    if '_at' in col:    # 시간 데이터
        df = df.assign(**{col:pd.to_datetime(df[col], format='ISO8601')})
        print('[+] {0:<25} >>> datetime'.format(col))
    elif '_id' in col:  # id 컬럼 -> obj형으로
        df = df.assign(**{col:df[col].astype('str')})
        print('[+] {0:<25} >>> str'.format(col))

[+] order_id                  >>> str
[+] user_id                   >>> str
[+] created_at                >>> datetime
[+] returned_at               >>> datetime
[+] shipped_at                >>> datetime
[+] delivered_at              >>> datetime
[+] order_items_id            >>> str
[+] product_id                >>> str
[+] inventory_item_id         >>> str
[+] created_at_order_items    >>> datetime
[+] shipped_at_order_items    >>> datetime
[+] delivered_at_order_items  >>> datetime
[+] returned_at_order_items   >>> datetime
[+] created_account_at        >>> datetime
[+] distribution_center_id    >>> str

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181759 entries, 0 to 181758
Data columns (total 39 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   order_id                  181759 non-null  object
 1   user_id                   181759 non-null  object
 2   status                    181759 non-null  object
 3   gender                    181759 non-null  object
 4   created_at                181759 non-null  datetime64[ns, UTC]
 5   returned_at               18232 non-null   datetime64[ns, UTC]
 6   shipped_at                118281 non-null  datetime64[ns, UTC]
 7   delivered_at              63841 non-null   datetime64[ns, UTC]
 8   num_of_item               181759 non-null  int64
 9   order_items_id            181759 non-null  object
 10  product_id                181759 non-null  object
 11  inventory_item_id         181759 non-null  object
 12  status_order_items        181759 non-null  object
 13  created_at_order_items    181759 non-null  datetime64[ns, UTC]
 14  shipped_at_order_items    118281 non-null  datetime64[ns, UTC]
 15  delivered_at_order_items  63841 non-null   datetime64[ns, UTC]
 16  returned_at_order_items   18232 non-null   datetime64[ns, UTC]
 17  sale_price                181759 non-null  float64
 18  first_name                181759 non-null  object
 19  last_name                 181759 non-null  object
 20  email                     181759 non-null  object
 21  age                       181759 non-null  int64
 22  state                     181759 non-null  object
 23  street_address            181759 non-null  object
 24  postal_code               181759 non-null  object
 25  city                      180078 non-null  object
 26  country                   181759 non-null  object
 27  latitude                  181759 non-null  float64
 28  longitude                 181759 non-null  float64
 29  traffic_source            181759 non-null  object
 30  created_account_at        181759 non-null  datetime64[ns, UTC]
 31  cost                      181759 non-null  float64
 32  category                  181759 non-null  object
 33  name                      181749 non-null  object
 34  brand                     181610 non-null  object
 35  retail_price              181759 non-null  float64
 36  department                181759 non-null  object
 37  sku                       181759 non-null  object
 38  distribution_center_id    181759 non-null  object
dtypes: datetime64[ns, UTC](9), float64(5), int64(2), object(23)
memory usage: 54.1+ MB

In [93]:
df.head(5)

,order_id,user_id,status,gender,created_at,returned_at,shipped_at,delivered_at,num_of_item,order_items_id,...,traffic_source,created_account_at,cost,category,name,brand,retail_price,department,sku,distribution_center_id
0,8,5,Cancelled,F,2022-10-20 10:03:00+00:00,NaT,NaT,NaT,3,13,...,Organic,2020-10-02 10:03:00+00:00,7.44325,Shorts,Grane Supergirl Shorts,Grane,15.67,Women,3D4893419E57449FB290647149F738D4,2
1,8,5,Cancelled,F,2022-10-20 10:03:00+00:00,NaT,NaT,NaT,3,11,...,Organic,2020-10-02 10:03:00+00:00,10.47081,Skirts,Woman Within Plus Size Petite flare skirt,Woman Within,24.99,Women,162D18156ABE38A3B32851B72B1D44F5,5
2,8,5,Cancelled,F,2022-10-20 10:03:00+00:00,NaT,NaT,NaT,3,12,...,Organic,2020-10-02 10:03:00+00:00,10.89564,Sweaters,LookbookStore Women Coloured Zip Mouth Smile S...,LookbookStore,24.99,Women,8A146F1A3DA4700CBF03CDC55E2DAAE6,5
3,60,44,Cancelled,F,2023-01-20 02:12:00+00:00,NaT,NaT,NaT,1,96,...,Search,2022-08-16 02:12:00+00:00,6.67707,Maternity,Lace Cami Top and Boxer Shorts Lingerie Set,Angelina Hosiery,16.99,Women,0563CAD67522FC198DEE8690630E475A,3
4,64,46,Cancelled,F,2021-12-06 09:11:00+00:00,NaT,NaT,NaT,1,100,...,Search,2020-01-07 09:11:00+00:00,22.06800,Sleep & Lounge,Calvin Klein Women's Nocturnal Elegance Camisole,Calvin Klein,36.00,Women,0A66E17D3CCDE15BDECB253E7E293294,3

In [94]:
len(df)

181759

In [67]:
len(order_items)

181759